app/views/messages/_message.html.erb

    <p><%= message.body %></p>
    <time datetime="<%= message.created_at %>" title="<%= message.created_at.strftime("%d %b  %Y at %I:%M%p") %>">
---
INSERT INTO "messages" ("body", "conversation_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "Hi"], ["conversation_id", 1], ["user_id", 1], ["created_at", "2015-06-13 07:06:30.188320"], ["updated_at", "2015-06-13 07:06:30.188320"]]