app/controllers/posts_controller.rb

  def index
  @users = User.where.not("id = ?",current_user.id).order("created_at DESC")
  @conversations = Conversation.involving(current_user).order("created_at DESC")
  # @posts = Post.order('created_at desc').all
  @posts = Post.where(nil) # creates an anonymous scope
  filtering_params(params).each do |key, value|
    @posts = @posts.public_send(key, value) if value.present?
---
SELECT "users".* FROM "users" WHERE (NOT (id = 1))  ORDER BY created_at DESC
SELECT "conversations".* FROM "conversations" WHERE (conversations.sender_id =1 OR conversations.recipient_id =1)  ORDER BY created_at DESC
SELECT "posts".* FROM "posts" WHERE (LOWER(name) like 'l%')
SELECT "posts".* FROM "posts"

  def create
    @post = current_user.posts.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("celular", "telefone", "castrado", "vacinado", "cidade", "name", "age", "animal", "gender", "size", "about", "user_id", "documentet_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15) RETURNING "id"