app/controllers/profiles_controller.rb

  def show
  	@user = User.find_by_profile_name(params[:id])
  	if @user
  		@posts = @user.posts.all
---
SELECT  "users".* FROM "users" WHERE "users"."profile_name" = $1 LIMIT 1  [["profile_name", "rafaelbenaion"]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 1]]